[
  {
    "name": "A' Bhuidheanach Bheag",
    "url": "https://www.walkhighlands.co.uk/munros/a-bhuidheanach-bheag",
    "description": "Park in layby 87, on the west side of the A9 about three quarters of a kilometre south of the Dalwhinnie turning. Cross the road (very carefully!) and head a short way along the verge to the north before going through a gate onto a vehicle track, passing under the pylons. and over the construction tracks for the new Beauly-Denny powerline. The hill track heads briefly north but soon bends to the right and begins to ascend the moor, with good views across the pass to A'Mharconaich and Geal Chàrn.\n\nContinue the easy ascent which keeps to the wide slope between two gullies. Nearing the plateau the track reaches an old quarry; the map is somewhat misleading in that this consists only of a shallow depression and a few blocks of quartz, and could be missed entirely when under snow. Continue on the track beyond the quarry, taking the left fork onto the broad ridge leading northeast. There is a line of fenceposts along here which may help navigation in mist. After a little under two kilometres the track is left as the ridge and fence bend to the right.\n\nA shallow depression is crossed before the final rise; this is very boggy underfoot unless it is frozen. Beyond, continue up the easy slope to the tiny cairn at the summit of Càrn na Caim. At 941 metres this is a Munro, and its position on the edge of the plateau makes it a good viewpoint. The dome of Meall Chuaich is in the foreground ahead, but the view extends across much of Badenoch to the Monadhliath, as well as across to the Cairngorms to the east and over range upon range to the west.\n\nReturn across the boggy bealach and back along the landrover track to where the plateau was initally reached, this time continuing south rather than returning to the 'quarry'. A track leads on at first, crossing a couple of dips in the plateau.\n\nBeyond the cairn on A'Buidheanach the plateau drops steeply, so it is better to bear left downhill a little before reaching this point to join a path skirting this lump. Another soggy bealach is crossed before a boggy path begins the ascent beyond, a little to the right of a small stream. The slope eases off as another plateau is reached, a short distance from the minor top of A'Buidheanach Mhor.\n\nHead southwest and then south for a short distance to reach the trig point of A'Buidheanach Bheag, the second Munro of the day at 936 metres. Truly dedicated baggers may notice on the map that there is a second summit at 936 about 500 metres to the west; it is impossible to say which is the true Munro summit but this second contender has no cairn and few visitors.\n\nOnce you are satisfied, return over all the bumps and dips back to the top of the landrover track near the 'quarry' for the easiest descent back to Drumochter."
  },
  {
    "name": "A' Chailleach (Fannichs)",
    "url": "https://www.walkhighlands.co.uk/munros/a-chailleach",
    "description": "Park at the parking area just past the forestry plantations and gated, signed track off the A832 to the south west of Braemore junction. From the parking area walk back along the road for 20 metres until you reach the track leading to Loch a Bhraoin; it is signed for long distance routes to Kinlochewe and Loch Fannich. Go past the barrier and along the track, with views of the mountains ahead. Soon a gate is reached and new paths head off to the left and right - turn left here, following a path which leads through the forestry and then down to a bridge over the outflow of the loch.\n\nFollow the stalker's path on the other side of the bank for a very short distance. As you reach the foot of the ridge heading up to Tomain Coinich turn right onto a boggy path heading straight up the slope of Leitir Fhearna, the nose of the ridge. From here the slope higher up looks rocky but it presents no difficulties apart from wet ground; the path easily negotiates the rocky sections.\n\nOnce past the rocky part the ridge flattens and there is a plateau riven with peat gullies. Avoid the worst of the peat by following the path round the right edge to reach the grassier ridge beyond. This gives a gentle and enjoyable climb, with good views of the corries in front of the Munros on either side. Do not be tempted to stay on the path traversing the right hand side of the ridge, this path eventually leads to the col between Toman Coinich and A Chailleach across a very steep and rocky final slope; it is better to follow the crest of ridge straight to the summit of Toman Coinich.\n\nFrom the summit of Toman Coinich there are fine views down to Loch Fannich and the surrounding hills. Follow the south easterly broad ridge down to the col, crossing wide bare steps caused by glaciation in the last ice age. From the col it is a straightforward climb to Sgùrr Breac. The true summit is not the first cairn on the little rise but is a couple of hundred metres further east atop of flat plateau, giving little impression of the cliffs to the north. This is the first Munro of the day, at 1000 metres.\n\nRetrace your steps to Tomain Coinich and then descend the indistinct ridge to the bealach opposite before climbing steadily up the grassy and much more well defined and enjoyable ridge up the far side; there are great views down the cliffs on the right side down to Loch Toll an Lochain in the corrie floor.\n\nKeep following the ridge as it flattens off at the junction with Sròn an Goibhre ridge (most easily identified by the old fence post stumps going off down the slope to the right). Here bear left, following the path to reach the summit of A Chailleach, the second Munro of the day, and a superb viewpoint both over Loch Fannich and into the remote peaks of the Fisherfield Forest.\n\nTo find the descent route return north east to where the fence posts led off and start descending the ridge of Sròn na Goibhre (no path). The descent is fairly steep to start with and then becomes gentle as it follows the spur. The ridge climbs slightly, crossing a rocky-knoll like summit.\n\nA couple of hundred metres beyond these is the best place to begin the very steep descent down the right flank of the ridge to the coire near the outflow of Loch Toll an Lochain. The slope is mostly steep grass and bog with some greasy boulders, but must be tackled to avoid the crags at the termination of the ridge to the north. Once down in the corrie turn left alongside the burn, crossing it as soon as possible. Further on ground steepens and the stream cascades into a ravine with a series of waterfalls; this is negotiated with a descending traverse to the right.\n\nBeyond the waterfalls, continue heading downhill diagonally towards Loch a Bhraoin. Note a fine sheepfold off to the left. Eventually a very boggy and faint ATV track can be picked up, aiming for the far corner of a fenced area. Pass this corner and continue to the shores of Loch a' Bhroain. Now follow the very rough and boggy track back to the bridge at the outflow of the loch. Cross this to return to the A832 by the outward route."
  },
  {
    "name": "A' Chralaig",
    "url": "https://www.walkhighlands.co.uk/munros/a-chralaig",
    "description": "Park in the layby on the north side of the A87, just over a kilometre east of the Cluanie Inn. Walk east for a short distance along the road to the start of the signposted path through the An Caorann Mòr (about a kilometre and a half east of the Cluanie Inn). Walk up the first steep section of track; after around 50m look out for a faint path heading off on the right. From here the route makes an unrelenting and direct climb up the steep grassy slopes to the northeast. The angle relents at about 750m where you emerge on the south ridge of A'Chralaig.\n\nTurn left along the ridge, which climbs in stages and becomes better defined as height is gained. At about 1000m the ridge turns northwest and leads easily to the massive and well-built cairn on the summit of A' Chralaig (which rather puzzingly means The Basket). There is a commanding view of the whole area, with Loch Cluanie being seen full length. The ridge now briefly leads northwards before a steeper rocky descent northwest and a northerly continuation down to a bealacb.\n\nFrom the dip on the ridge, continue still with a clear path, crossing the 1008m top where it turns once more to the right to reach another col. From here the ridge goes north once more, and becomes very narrow. For part of the way the ridge crest is broken into a series of rocky towers; keen and able scramblers might cross these, but most walkers will use the clear bypass path which avoids them to the right before crossing back over the ridge and avoiding the last section to the left. Even the bypass path has one short rocky step but this shouldn't give most hillwalkers any difficulty.\n\nThe summit of Mullach Fraoch-Choire is a short distance beyond the difficulties. The second Munro of the day at 1102 metres has great views over the wilds at the head of Glen Affric though most walkers will most enjoy looking back along the ridge to A'Chralaig. From here, return back down the difficult section of ridge or bypass path, before leaving the ridge to the right at the col before the 1008 metre top. The descent is on a path down steep scree at first but the grassy upper reaches of Coire Odhar are soon reached.\n\nContinue the descent down Coire Odhar; it is possible to bear left slightly southwest lower down to shorten the walk back. The path through the Glen is reached at its foot; turn left along it and climb towards the low pass ahead. The pass itself is very boggy underfoot; aim for the start of the landrover track in the An Caorann Mòr which relieves the tedious going. Continue down this track to return to the start."
  },
  {
    "name": "A' Chailleach (Monadhliath)",
    "url": "https://www.walkhighlands.co.uk/munros/a-chailleach-monadhliath",
    "summary": "This long hillwalk includes ascents of three of the four Monadh Liath Munros. The hills themselves are undistinguished (particularly Càrn Sgulain), but Càrn Dearg has a feeling of remoteness and the long trek across the plateau from this peak to the others gives a feeling of great space, given favourable weather.",
    "description": "Park at the end of the minor road leading from Newtonmore into Glen Banchor. This is an attractive, surprisingly wild little glen given its position close to the town. Continue on foot along the track up the glen, almost immediately crossing the bridge over the Allt a Chaorainn. The track leads past a plantation and passes close to the site of a deserted township. Just before the house and bridge over the Allt Fionndrigh, take the track which bends off to the right. This leads up into Gleann Fiondrigh, which lacks the open aspect of Glen Banchor, being hemmed in by the foothills of the Monadhliath.\n\nContinue on the track up Gleann Fionndrigh until peters out into a boggy ATV track. Bear left from here to head down to a footbridge over the Allt Fhionndrigh. Follow the ATV track as it now heads southwest up towards a featureless bealach above the west side of the glen, becoming very boggy underfoot. On the wide bealach the route forks - ATV tracks swing both left and uphill to the right. Take the latter, then fork left part way up the slope.\n\nThe very boggy ATV tracks (which may not always be distinct) come closer to the Allt Ballach in upper Gleann Ballach, before rising gently up the eastern side of the glen. The summit of Càrn Dearg rises impressively atop a crag on the opposite side of the glen. As the head of Gleann Ballach is reached the route peters out towards the boggy bowl at the head of the glen.\n\nHere a wide grassy ramp enables an easier climb to the southwest, avoiding coming close to any crags. As height is gained the going becomes dry at last, and an improving path heads up onto the ridge a short distance north of the summit of Càrn Dearg. Continue along the edge to reach the summit cairn, which at 945 metres is the highest of the Monadhliath; the position of the cairn on the edge of the steep drop to Gleann Ballach ensures it is also the finest peak of the range.\n\nRetrace your steps briefly but then continue northwards onto the stony ground around the summit of Càrn Ban. North and west from here stretches the vast, empty and almost featureless plateau of the Monadhliath, as little visited as any ground in Britain. Our onward route is generally northeast, passing over the top of Càrn Ballach and then reaching Meall na Creughaich; all the time the ground underfoot becomes less stony and boggier. Another three kilometres from here, now heading eastwards, is Càrn Sgulain, the second of the day's Munros, and one of the most featureless on Sir Hugh's list.\n\nFinding the route all across the plateau from Càrn Ban to this Munro would be difficult indeed in bad visibility but a line of old metal fenceposts offers guidance. There is little to detain you on Càrn Sgulain's summit, which could be either a small cairn or a larger one slightly further on, so return a short distance southwest to the last bealach, then bearing south-southwest to cross the Allt Cuil na Caillich.\n\nThis stream has cut a steep little 'v'-shaped valley into the plateau, so heading this way is necessary to avoid the steepest drop down to it. Once across the stream and above the steep bank beyond, continue easily southeast to the third Munro, A'Chailleach.\n\nThis is a popular destination in its own right for walkers staying at Newtonmore, and the summit is marked by a huge cairn (visible for miles around across Badenoch), with a windshelter set into one side. The descent route has the benefit of a rough path for much of the way. Begin by heading south; the ascent eventually becomes more gradually and crosses a boggy area. Eventually it descends southeast near a burn into the glen, with great views down towards Newtonmore.\n\nThree-quarters of the way down you'll pass a little corrugated iron hut which offers very rough shelter on a wild day. Further down it is necessary to cross the Allt a'Chaorainn to reach a better path on the far side; this is usually possible using stones and boulders unless in spate (there's a footbridge a short distance downstream). Follow the path down the far side, which almost immediately becomes a track. This leads directly down the glen, passing the forestry plantations at its foot to return directly to the start."
  },
  {
    "name": "A' Ghlas-bheinn",
    "url": "https://www.walkhighlands.co.uk/munros/a-ghlas-bheinn",
    "summary": "A Ghlas Bheinn is a relatively small Munro, seeming at first glance to be rather overshadowed by neighbouring Beinn Fhada. On closer aquintance it is revealed as a rocky mountain of great character. The ascent here is combed with a visit to the Falls of Glomach - the finest in Scotland.",
    "description": "Turn off the A87 at Morvich, and park at the National Trust for Scotland Morvich countryside centre, opposite Morvich Caravan Club site. Start by walking along the continuation of the road, then crossing the bridge at Innichro at its end. Keep ahead on the track on the far side before looking out for a signed path which heads off right after 60m. The path passes through a couple of gates and eventually continues up the glen above the Abhainn Chonaig.\n\nAfter a couple of kilometres keep right at a fork. For the most part the path keeps well above the river as it heads up the increasingly wild glen. The Allt a Choire Chaoil can usually be crossed on boulders, though it may be difficult or dangerous in spate.\n\nThe stalkers path then climbs several zigzags en route for the Bealach an Sgairne. Ignore the path off to the right (which leads to Beinn Fhada), and continue on the main path which cuts dramatically across the steep hillside before continuing the climb up to the pass.\n\nThe Bealach na Sgairne is marked by a large cairn and has a great view back down Gleann Choinneachain. The narrow hill path continuing onto A'Ghlas-bheinn climbs north from here; it keeps left to avoid the crags just above the pass before cutting back up to the ridge. The ill-defined ridge climbs steeply at first, soon giving great views back towards Beinn Fhada. It continues past a small lochan and over a series of rocky undulations.\n\nThere are several false summits before the small summit cairn finally is reached, perched atop some slabby rocks. A Ghlas-bheinn is a Munro at 918m, and has stunning views, especially towards the coast and Skye.\n\nThe easiest descent route is to retrace steps, or you could descend via the west ridge, but the route described here enables a visit to the made to the Falls of Glomach - recommended if you have the energy and have not visited them previously. Descend with care northwards from the summit, taking care to avoid broken crags (there's a grassy gully to the left).\n\nOnce down the steep section the easiest going is to traverse the moorland to the left of the ridgeline, rather than climbing over the knobbly peaks. The going is pathless and navigation requires care, keeping the steep ground rising up on your right. Once flatter ground is reached west of Meall Dubh, another steeper descent leads down to the Bealach na Sroine, where the clear path to the Falls of Glomach is joined.\n\nTo visit the falls turn right along the path, which undulates a little before beginning a descent towards the unseen gorge of the Falls of Glomach ahead. A sign indicates that it is dangerous to proceed further, but most visitors will continue very carefully down to a ledge which has a terrific view of the great falls, where the Allt a'Ghlomaich tumbles in two great leaps down into an awesome gorge. Return back up the path to the Bealach na Sroine.\n\nThis time continue on the main path which descends the right hand side of the valley to reach the top of the forestry plantations. Cross the bridge and follow the track down the east side of the river. At the next fork, keep right and the track crosses back over the river. Another track soon joins in from the right. Keep left at the next fork and then turn right through a gate into an open area, crossed by a path. As you comes near the river turn left to another gate - pass through and then descend a path left to reach and cross a footbridge. On the far side the path climbs up to rejoin the outward route. Turn right and retrace your steps back to Morvich."
  },
  {
    "name": "A' Mhaighdean",
    "url": "https://www.walkhighlands.co.uk/munros/a-mhaighdean",
    "summary": "The Fisherfield Forest - also known as the Great Wilderness - contains the remotest Munros in all Scotland. The effort required is fully repaid, however, as this is a spectacular region of dramatic peaks and ridges - the views from the summits are often claimed to be the finest in Scotland. The route is an epic round of all five Munros and one Corbett, starting and finishing at Shenavall bothy or a nearby wild camp.",
    "description": "The walk is described from Shenavall bothy; this can be reached via a walk-in from Corrie Hallie as described on the Shenavall route. The bothy is maintained by volunteers from the Mountain Bothy Association; please help by carrying out any rubbish you find here, and always follow the bothy code when visiting. An alternative is to wild-camp; there is a great spot in the alder woods at NH088788; this is best reached by following the track used as the way back on the Shenavall circuit.\n\nFrom Shenavall Beinn a' Chlaidheimh rises extremely steeply across Strath na Sealga; although it is possible to make a direct assault many walkers will prefer to head up the strath and then approach it from the east, so start along the path which leads ESE. It becomes a track near the ruined house at Achneigie. Continue for another 1.5km - the alder woodland over to the right makes a great spot for a wild camp - until the track begins to climb to the left (bound for Corrie Hallie); instead follow a fainter, grassy track which heads west at this point and leads alongside the Abhainn Loch an Nid. This river must be waded - as with two river crossings at the end of the walk, this is not possible if the level is high.\n\nOn the far side, head directly up the slopes of Beinn Chlaidheimh. After wet but steep heather initially the slope eases to a more gradual grind until the much fiercer upper slopes are reached around 500m. Pass just left of the crags that guard the nose of the main ridge, making your way up steep heather as soon as practical to reach the ridge above at a flattish shoulder. There is then a brief climb up easy scree to gain the narrow summit ridge at point 900m. Follow this airy but grassy ridge across a slight dip to reach the summit cairn, with great views down the very steep west face into the strath, as well as back over the pinnacles of An Teallach. The descent begins almost immediately, with a path down the scree slope to a first bealach at 787m. Continue over a broad and bumpy section of ridge before a second descent leads down to a lower bealach at 650m, marked by a couple of lochans.\n\nContinue south up rough quartzite boulders to gain the very broad NE ridge of Sgùrr Ban. The ridge is littered with rough boulders all the way up the long pull to the top; there is grassier ground further right but this leads onto steeper terrain higher up. The summit cairn is in the centre of a small plateau but the walk continues in the same direction, heading down fairly straightforward slopes to reach the bealach at Cab Coire nan Clach. The next Munro, Mullach Coire Mhic Fhearchair, rises in intimidatingly steep slopes. However, there is an eroded path which leads up scree for the steepest part of the climb, and in good weather it can easily be picked out on the descent from Sgùrr Ban. The slope then eases and continues - still over stones and boulders - to the summit, the highest of the Fisherfield 6.\n\nThe descent is less steep, leading SW and then S, but even more covered with quartzite boulders which make it more time consuming. From the bealach beyond, the steep 851m peak of Meall Garbh appears to be a formidable obstacle, but a bypass path avoids this by cutting across its very steep NW slope to reach a second, lower bealach. From here the slopes of Beinn Tarsuinn are broad and mostly grassy, hiding the drama of the other side of this mountain, which is revealed only as the summit cairn is reached. Follow the narrow ridge to the left to soon reach a square tilted platform which sits astride the mountain and has been likened to a tennis court. A path scrambles easily up onto the 'Tennis Court' to reach a cairn at the far end before descending once more. The next section of ridge is riven into a series of pinnacles, but the walk continues by taking a clear bypass path which runs around the left side.\n\nContinue along the bypass path until a clear path forks off left very steeply down the loose slope. This leads to the extensive and very boggy bealach between Beinn Tarsuinn and A' Mhaighdean - the lowest point of the walk at 525m. The pull up to A' Mhaighdean from here is a very long grind up a broad, grassy slope - a real effort for tired legs. The lure is what is regarded as the remotest of all Munros - and perhaps the finest Munro summit view. The highest point is right on the edge of an abyss as the slopes to the west plunge for 800m down dramatic crags to the Dubh Loch, with Fionn Loch and the sea beyond and amazing rock architecture all around. The view south down to Gorm Loch Mòr and the crags of Beinn Lair is scarcely less impressive, and summiting A' Mhaighdean must be ranked amongst the highlights of a round by any Munroist.\n\nHead towards the more dome-like northern top before descending steep but largely grassy slopes and then rocky ground to reach the Poll Eadar dha Stac, the pass at the foot of Ruadh Stac Mòr . There is a very rough stone bivouac shelter here, which may be of use in an emergency. The last Munro of the round, Ruadh Stac Mòr , rises directly above and the route to it appears to be barred by a band of crags, whilst a stalkers path cuts off to the left to descend past Fuar Loch Mòr . A small cairn, however, marks the point to strike up the well-worn scree slope to reach the foot of the cliffs. The route through the crags above can be picked out during the descent from A' Mhaighdean; it heads up an eroded gully above the scree slope. Getting into the gully requires a straightforward scramble, best started slightly along a ledge to the right from the top of the scree path. From here a big scrambling step up leads onto a wide, well-worn stony gangway that slopes to the left and then continues up the gully before emerging on the boulderfields of the upper slopes.\n\nA faint path winds up the boulders and passes through a gap in the summit crags to reach the cairn. This is another superlative viewpoint in the very heart of the wilderness, surrounded by dramatic rock peaks and glistening lochans; to the north are the Lochan a'Bhragdad backed by the perfect cone of Beinn Dearg Bheag and the pinnacled ridges of Beinn Dearg Mòr beyond. Head along the NNW ridge - negotiating yet more boulderfields - for around 250m before aiming directly between the two lochans to the NE. The slope is terraced with several steeper sections unseen from above. Pass between the lochans and continue north, following a burn down into the hanging valley below. Cross the burn and aim diagonally up the slope opposite to pick up an excellent stalkers path above the Clach na Frithealaidh - a prominent rock.\n\nFollow the path to the right. It angles down towards Loch Beinn Dearg before swinging back to lead easily down Gleann na Muice Beag, eventually leading down to a path running along the Abhainn Ghleann na Muice, a substantial river. Continue down this path to reach the chalet and cottage amidst the group of trees at Larachantivore. Wade the river near here - again, this is impossible in spate. The direct route back to Shenavall now crosses a severe bog, with great care needed to avoid stepping into one of many waist-deep, slime-filled pools, before reaching the second river, the Abhainn Strath na Sealga, just short of the bothy. Alternatively you could continue by the riverbank to the junction of the two rivers. Either way, the second river too needs to be waded before heading back to Shenavall."
  }
]